---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentsRepresentation
source: html/2f74ce97-9cb5-52ad-23d1-42eed894620f.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentsRepresentation Property

Identifies how the bending detail will represent the segments of the bar.

## Syntax (C#)
```csharp
public BendingDetailSegmentsRepresentation SegmentsRepresentation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration